//let 変数名 = 内容 ;
//let hello = 'Hello World';
//alert(hello);


//変数は数値、文字列、関数を代入できる。

// 整数を代入する
//let int1 = 1;
// 負数を代入する
//let int2 = -10;
// 小数点を代入する
//let float1 = 3.14;
// 文字列を代入する
//let str1 = 'JavaScriptを覚えよう';
//alert(str1);


//四則演算
// 足し算
//alert(4 + 3);
// 引き算
//alert(8 - 5);
// 掛け算
//alert(2 * 6);
// 割り算
//alert(10 / 2);


//文字列の結合
//alert('Hello' + 'World');

//let str1 = 'Hello';
//let str2 = 'World!!';
//alert(str1 + str2);


//条件分岐

//条件式が１つの場合
//if(条件1){
//  処理1
//}
// 条件1を満たすときは、処理1を実行

//1つの条件式で、処理を2つに分ける場合
//if(条件1){
//  処理1
//} else{
//  処理2
//}
// 条件1を満たすときは処理1、満たさないときは処理2を実行

//2つの条件式で処理を分ける場合
//if(条件1){
//  処理1
//} else if(条件2){
//  処理2
//} else{
//  処理3
//}
// 条件1を満たすときは処理1、条件2を満たすときは処理2、どちらも満たさないときは処理3を実行

//let orange = 100;
//let apple = 120;

//if(orange < apple){
//  alert('みかんの値段がりんごより安い');
//} else if(orange == apple){
//  alert('みかんとりんごが同じ値段');
//} else{
//  alert('みかんの値段がりんごより高い');
//}


//繰り返し処理
